In [1]:
# jai maa saraswati

In [2]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
data = [4,8,15,16,23,42]

In [5]:
my_series = pd.Series(data)

In [6]:
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
data2  = [11,22,33,44,55,66,77,88,99,100]

In [8]:
my_data = pd.Series(data)

In [9]:
print(my_data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [10]:
# let us creating the Pandas data frame ^_^ 
data = {'Name' :['Alice' , 'Bob' , 'Claire'] ,
'Age' : [25 , 30 , 27],
'Gender' : ['Female' , 'Male', 'Female']}

In [11]:
df = pd.DataFrame(data)

In [12]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example

DATAFRAME => IN PANDAS "DATAFRAME" IS THE 2D TABULAR DATA STRUCTURE WHICH IS DESIGNED TO STORE AND 
             MANIPULATE THE HETROGENEOUS DATA SMIMILR LIKE SQL. IT PROVIDE THE CONVINENT WAY TO WORK
             WITH STRUCTURED DATA . 
             
LET US DISCUSSING THE MAJOR DIFFERENCE BETWEEN THE PANDAS.SERIES() AND PANDA.DATAFRAME()

* PANDA SERIES :-
(i) ONE-DIMENSIONAL
(ii) HOMOGENEOUS DATA
(iii) INDEXED
(iv) SIMILAR TO ROW & COLUMN 

let us taking an example of pandas series :-

In [13]:
data3 = [12,34,5,68,90,43]

In [14]:
import_data2 = pd.Series(data3)

In [15]:
print(import_data2)    # this is the example of the pandas.Series

0    12
1    34
2     5
3    68
4    90
5    43
dtype: int64

PANDA DATAFRAME

* IT HAS TWO-DIMENSIONAL 
* COLUMNS IN THE DATAFRAME HAS DIFFERENT TYPES OF DATA TYPES
* IT IS SIMILAR TO SQL-TABLE 
* IT CAN BE TOUGHT OF AS CONTAINER FOR PANDA SERIES 

let us Taking an example of panda Dataframe :-

In [16]:
data5 = {'Name' : ['shubham_shah' , 'ss' , 'kvs'],
        'Age' : [17,18,19],
        'Place' : ['sonpur' , 'space', 'milkyway']}

In [17]:
koex = pd.DataFrame(data5)

In [18]:
print(koex)  # This is the example of the DataFrame

           Name  Age     Place
0  shubham_shah   17    sonpur
1            ss   18     space
2           kvs   19  milkyway

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ANSWER => WE ARE USING SO MANY FUNCTIONS IN THE PANDAS DATAFRAME JUST LIKE - CREATION OF DATA FRAME , 
          READING & WRITING DATA , VIEWING AND INSPECTION OF DATA , SORTING DATA , CLEARING DATA .
          
          
LET US TAKING AN EXAMPLE TO SHOW THESE FUNCTIONS :-

from the above example of koex show the function of creating the DataFrame let us taking an another example

In [19]:
df = pd.read_excel("Financial Sample.xlsx")

In [20]:
df.describe()

,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Month Number,Year
count,700.000000,700.000000,700.000000,7.000000e+02,700.000000,7.000000e+02,700.000000,700.000000,700.000000,700.000000
mean,1608.294286,96.477143,118.428571,1.827594e+05,13150.354629,1.696091e+05,145475.211429,24133.860371,7.900000,2013.750000
std,867.427859,108.602612,136.775515,2.542623e+05,22962.928775,2.367263e+05,203865.506118,42760.626563,3.377321,0.433322
min,200.000000,3.000000,7.000000,1.799000e+03,0.000000,1.655080e+03,918.000000,-40617.500000,1.000000,2013.000000
25%,905.000000,5.000000,12.000000,1.739175e+04,800.320000,1.592800e+04,7490.000000,2805.960000,5.750000,2013.750000
50%,1542.500000,10.000000,20.000000,3.798000e+04,2585.250000,3.554020e+04,22506.250000,9242.200000,9.000000,2014.000000
75%,2229.125000,250.000000,300.000000,2.790250e+05,15956.343750,2.610775e+05,245607.500000,22662.000000,10.250000,2014.000000
max,4492.500000,260.000000,350.000000,1.207500e+06,149677.500000,1.159200e+06,950625.000000,262200.000000,12.000000,2014.000000

In [21]:
df.dtypes

Segment                        object
Country                        object
Product                        object
Discount Band                  object
Units Sold                    float64
Manufacturing Price             int64
Sale Price                      int64
Gross Sales                   float64
Discounts                     float64
 Sales                        float64
COGS                          float64
Profit                        float64
Date                   datetime64[ns]
Month Number                    int64
Month Name                     object
Year                            int64
dtype: object

In [22]:
df[['COGS' , 'Gross Sales' , 'Profit']]

         COGS  Gross Sales    Profit
0     16185.0      32370.0  16185.00
1     13210.0      26420.0  13210.00
2     21780.0      32670.0  10890.00
3      8880.0      13320.0   4440.00
4     24700.0      37050.0  12350.00
..        ...          ...       ...
695  618750.0     742500.0  12375.00
696  136500.0     163800.0   2730.00
697    6840.0       9576.0   1299.60
698    3615.0       5061.0    686.85
699    5418.0      21672.0  13003.20

[700 rows x 3 columns]

In [23]:
df.head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,None,1618.5,3,20,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,None,1321.0,3,20,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,None,2178.0,3,15,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,None,888.0,3,15,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,None,2470.0,3,15,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

In [24]:
df.tail()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
695,Small Business,France,Amarilla,High,2475.0,260,300,742500.0,111375.00,631125.00,618750.0,12375.00,2014-03-01,3,March,2014
696,Small Business,Mexico,Amarilla,High,546.0,260,300,163800.0,24570.00,139230.00,136500.0,2730.00,2014-10-01,10,October,2014
697,Government,Mexico,Montana,High,1368.0,5,7,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

From the above the examples shows that DataFrame functions useages .

Q6. Which of the following is mutable in nature Series, DataFrame, Panel ?

ANSWER :-
* Series 
* DataFrame

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
series1 = pd.Series([1,2,3] , name='Column1')
series2 = pd.Series(['A','B','C'] , name='Column2')
series3 = pd.Series([242.33,47.93,682.34] , name='Column3')

In [26]:
df = pd.DataFrame({series1.name : series1 , series2.name : series2 , series3.name : series3})

In [27]:
print(df)

   Column1 Column2  Column3
0        1       A   242.33
1        2       B    47.93
2        3       C   682.34